In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

# 7.1處理遺失資料

* pandas使用了浮點數值NAN(Not a Number)來代表遺失資料 -> 稱為標記值

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

* Python內建的None也會被當成NA(R 語言中的not available)

In [5]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## NA處理方法
|參數|描述|
|:-:|:-:|
|dropna|以指定軸上的標籤為單位，過濾每個指定的標籤是否有遺失資料值，對於遺失資料的容忍有不同的限定值|
|fillna|將遺失資料已指定的值取代，或使用內插值方法如'ffill'或'bfill'|
|isnull|回傳布林值，指出目標是否為遺失值|
|notnull|isnull的反向函式|

## 過濾遺失值

* 對Series來說，dropna會回傳非遺失資料與他所屬的index

In [7]:
from numpy import nan as NA

In [4]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [3]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
# 等校於上面寫法
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

* 對DataFrame來說，dropna預設只要列裡有缺失值就會濾除該列

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

* 指定how='all'的話，只會濾除全部為NA的列

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

* 傳入axis=1 -> 改為對欄做一樣的效果

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

* 過濾DataFrame時常會需要考慮時間序列資料，可以使用thresh參數指定

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.026420  0.076882 -0.139649
1 -0.689907  0.360060  1.731116
2 -0.579787  1.162763 -0.002905
3  1.095541  1.235842  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [16]:
df.iloc[:4, 1] = NA
df

          0         1         2
0  1.026420       NaN -0.139649
1 -0.689907       NaN  1.731116
2 -0.579787       NaN -0.002905
3  1.095541       NaN  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [18]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.026420       NaN       NaN
1 -0.689907       NaN       NaN
2 -0.579787       NaN -0.002905
3  1.095541       NaN  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [19]:
df.dropna()

          0         1         2
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [21]:
df.dropna(thresh=2)

          0         1         2
2 -0.579787       NaN -0.002905
3  1.095541       NaN  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

## 為缺失值填值

* 可使用fillna將要用的常數取代值傳入

In [22]:
df.fillna(0)

          0         1         2
0  1.026420  0.000000  0.000000
1 -0.689907  0.000000  0.000000
2 -0.579787  0.000000 -0.002905
3  1.095541  0.000000  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

* 可使用dict型態來指定不同欄填入不同值

In [32]:
df.fillna(value={1: 0.5, 2: 0})

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330  0.500000  1.590113
3  0.578254  0.500000 -0.857108
4  1.096050  0.500000  0.000000
5 -1.864860  0.500000  0.000000

* fillna執行完後，會傳回一個物件，也可以使用in-place來修改原資料

In [24]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.026420  0.000000  0.000000
1 -0.689907  0.000000  0.000000
2 -0.579787  0.000000 -0.002905
3  1.095541  0.000000  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

* 重作索引中的內插法，在fillna中也可使用

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330 -1.376318  1.590113
3  0.578254  2.259484 -0.857108
4  1.096050  0.104948  1.306140
5 -1.864860 -1.316316  0.372358

In [26]:
df.iloc[2:, 1] = NA
df

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330       NaN  1.590113
3  0.578254       NaN -0.857108
4  1.096050       NaN  1.306140
5 -1.864860       NaN  0.372358

In [27]:
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330       NaN  1.590113
3  0.578254       NaN -0.857108
4  1.096050       NaN       NaN
5 -1.864860       NaN       NaN

In [28]:
df.fillna(method='ffill')

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330  0.347715  1.590113
3  0.578254  0.347715 -0.857108
4  1.096050  0.347715 -0.857108
5 -1.864860  0.347715 -0.857108

In [29]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330  0.347715  1.590113
3  0.578254  0.347715 -0.857108
4  1.096050       NaN -0.857108
5 -1.864860       NaN -0.857108

* 可使用fillna將平均值或中位數傳到一個Series中

In [30]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## fillna函式參數
|參數|描述|
|:-:|:-:|
|value|用來填充缺失值的常數或類dict物件|
|method|內插的方法，如果函式沒有使用其他參數的話，預設是'ffill'|
|axis|要填充的軸向，預設為axis=0|
|inplace|直接修改呼叫的物件，不產出複製資料|
|limit|向前或向後填充時，最大的填充數|

## 7.2資料轉換

## 移除重複值

In [33]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

* DataFrame的duplicated方法會回傳一個布林Series，用來指出每個列有沒有重複值(與前面的列相比)

In [34]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

* drop_duplicates -> 直接回傳DataFrame，內容是duplicated中標示為False的資料

In [35]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

* 上面兩種方法都會對全部資料做檢查
* 可在duplicated內中放入欄名稱來進行部分檢查

In [37]:
# 增加新的一欄
data['v1'] = range(7)

In [38]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

* duplicated和drop_duplicates預設會保留第一個看到的重複值，若設定keep='last' -> 會保留使用最後一個重複值

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 使用函示或對應關係轉換值

* 使用某些資料集合時，可能會需要使用某一欄的值，對於資料集合進行某種轉換

In [6]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon', 
                              'pastrami', 'honey ham', 'nova lox'], 
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

* 接下來為這些肉品新增相對應的動物對照表

In [7]:
meat_to_animal = {'bacon': 'pig', 
                  'pulled pork': 'pig', 
                  'pastrami': 'cow', 
                  'corned beef': 'cow', 
                  'honey ham': 'pig', 
                  'nova lox': 'salmon'}

* 使用str.lower()將肉品名稱統一為小寫

In [8]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [9]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

* 只傳遞單一函數就可以完成所有工作的方法

In [11]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 取代值

In [12]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

* 使用pandas的replace函數將-999取代為NA值(除非指定in-place，不然會回傳一個新的Series)

In [13]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

* 如果需取代多個值，可以傳入一個list，後面再加上要替換的值

In [14]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

* 若是想對不同的目標值使用不同的替換值，也可以傳入替換值list

In [15]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* 也可以使用dict型態傳入

In [16]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* <font color=yellow>data.replace與data.str.replace不同，data.str.replace是做元素級的字串轉換</font>

## 更名軸index

* 與Series一樣，軸標籤也可以藉由函式或對應進行轉換，產出帶有新標籤的另一個新物件
* 你也可以in-place修改，不建立新的資料結構

In [18]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

* 軸的index物件跟Series一樣，都有一個較map的方法

In [19]:
transform = lambda x: x[:4].upper()

In [20]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

* 可以對index給值，就是in-place修改同一個DataFrame物件

In [21]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

* 如果不想動到原來的東西，但想建立一個新轉換過的index的資料集合 -> 可以使用rename

In [22]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [23]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

* rename還可以搭配dict物件，取代部分軸標籤

In [24]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

* rename可以節省手動複製DataFrame和指定index和columns屬性的時間，若想in-place的修改一個資料集，就指定inplace=True

In [26]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 離散化和分組